import streamlit as st 

# st.set_page_config(page_title='螺蛳粉销售数据分析', layout='wide')

st.write('## <center>某电商平台L类目经营分析</center>',unsafe_allow_html=True)
st.write('### 项目背景')
st.write("""
         本次项目收集了2020年7月1日至12月31日某平台不同店铺中螺蛳粉的销售信息。平台想通过了解2020年下半年螺蛳粉的销售数据，以便对2021年这一品类的广告投放提供策略依据。从购买人数、店铺及商品维度进行分析，了解整体销售数据、价格区间、地域偏好，对下一步的商业策略进行指导。
         """)
st.write('### 数据集介绍')
st.write("""
         下图所示为示例数据集，销售数据为虚拟，相关字段描述如下。
         - 商品名称：螺蛳粉在不同店铺的售卖名称。
         - 店铺名称：商品所在店铺的名称。
         - 价格：不同店铺、不同商品售卖的价格。
         - 购买人数：购买商品的人数。
         - 买家地址：买家所在地域。
         """)
st.image(['sql_pic/1.png','sql_pic/2.png'])
st.write('### 分析思路')
st.write('#### 一、明确分析的角度')
st.write("""
         得到数据集并理解各字段的含义之后，根据项目需求，需要获得平台本次销售的基本信息，包含商品种类数、店铺数、总销售额和总购买人数等。\n\n从数据分析中得出最受欢迎的商品种类和买家地域偏好，以及价格区间对销售数量的影响。\n\n分析问题如下:
         \n\n(1)分析平台售卖螺蛳粉的店铺数、总销售额、商品种类数、总购买人数等。
         \n\n(2)找出销售额排名前10的店铺，并明确其购买人数、销售额。
         \n\n(3)找出购买人数排名前10的商品，并明确其购买人数。
         \n\n(4)明确螺蛳粉商品的价格区间是怎么分布的，以及每个区间的占比（按照0～50元，51～100元，101～150元，150元以上区间进行分析）。
         \n\n(5)找出螺蛳粉购买人数最多的前10个地域。
         """)
st.write('#### 二、角度分析')
st.write('##### 1. 分析平台售卖螺蛳粉的店铺数、总销售额、商品种类数、总购买人数等')
st.write("""        
         统计数量需要用到汇总函数，统计时需要去掉重复数据，可以使用关键字distinct。
         其中，销售额=价格×销售数量。在本案例中，每人每次只购买一件商品，所以此处销售数量即用“购买人数”字段来计算。
         \n\nSQL语句的书写方法如下：
         """)
st.image('sql_pic/3.png')
st.write("""
         为了显示方便，总销售额和总购买人数分别以“万元”和“万人”(10000)为计量单位，
         所以上述SQL语句需要用到连接字符串的函数concat()。
         \n\n查询结果如下图所示。
         """)
st.image('sql_pic/4.png')
st.write("""
         分析结论：\n\n平台售卖螺蛳粉的店铺数有1426家，商品种类数达到4157个，总销售额为28959.49万元，\n 总购买人数为686.51万人。整个品类在平台的售卖竞争者多且购买者需求旺盛。""")
st.write('##### 2. 找出销售额排名前10的店铺，并明确其购买人数、销售额')
st.write("""
         (1)每个店铺的购买人数、销售额。\n\n按店铺名称分组（group by店铺名称），按销售额汇总，得到每个店铺的销售额。\n\nSQL语句的书写方法如下：
         """)
st.image('sql_pic/5.png')
st.write("""
         (2)找出销售额排名前10的店铺。\n\n按销售额从高到低排序（order by sum（（价格）＊（购买人数））desc），排在前10名的店铺就是用limit 10返回的前10行数据。\n\nSQL语句的书写方法如下：
         """)
st.image('sql_pic/6.png')
st.write('查询结果如下图所示')
st.image('sql_pic/7.png')
st.write('分析结论：\n\n销售额Top 1的店铺为“好欢螺旗舰店”，销售额为5878.68万元，Top 2店铺“李子柒旗舰店”的销售额为2686.26万元，Top 3店铺“嘻螺会鼎蓉鲜专卖店”的销售额为748.62万元。\n\n可以看出，第1名的销售额约为第2名的2.1倍，约为第3名的7.8倍，从第4名开始销售额差距缩小。')
st.write('##### 3. 找出购买人数排名前10的商品，并明确其购买人数')
st.write("""
         (1)每个商品的购买人数。
         \n\n按商品名称分组（group by商品名称），对购买人数汇总（sum()函数）。
         \n\n(2)购买人数排名前10的商品。
         \n\n按销售额从高到低排序（order by sum（购买人数）desc），排在前10名的店铺就是用limit 10返回的前10行数据。
         \n\nSQL语句的书写方法如下：
         """)
st.image('sql_pic/8.png')
st.write('查询结果如下图所示')
st.image('sql_pic/9.png')
st.write("""
         分析结论：
         \n\n按照购买人数前10的排名，得出平台中最受欢迎的螺蛳粉商品。
         \n\n购买人数Top1的商品名称为“预售　李子柒柳州螺蛳粉广西特产正宗螺蛳粉方便面米线螺蛳粉3袋”，
         购买人数为650003人，约为第2名的2倍多。从第2名开始购买人数差距缩小。分析可得出消费者在购买中倾向“李子柒”牌螺蛳粉。
         \n\n可以继续下钻分析，用户倾向于购买“李子柒”品牌，是因为“李子柒”品牌的商品价格比其他商品的低吗？
         \n\n在前述SQL语句中增加查询字段“价格”，以显示商品的价格。SQL语句的书写方法如下：
         """)
st.image('sql_pic/10.png')
st.write('查询结果如下图所示')
st.image('sql_pic/11.png')
st.write("""
         分析结论：
         \n\n从商品价格来看，螺蛳粉每袋单价在10元左右，最受欢迎的前10名的商品基本为3袋装，价格集中在35～45元。
         第一名“李子柒”品牌的螺蛳粉价格比“好欢螺”品牌仅高出1元钱，在价格上并无太大差异，购买人数却有2倍差距，
         所以用户购买“李子柒”品牌商品并不是因为商品价格，更可能是因为商品有品牌效益。
         """)
st.write('##### 4. 明确螺蛳粉商品的价格区间是怎么分布的，以及每个区间的占比（按照0～50元，51～100元，101～150元，150元以上区间进行分析）')
st.write("""
         区间分析问题要用到case表达式来解决。以价格在0～50元区间为例，用case表达式得到价格区间，
         价格区间范围使用between。用汇总函数count()对该区间计数。SQL语句的书写方法如下：
         """)
st.image('sql_pic/12.png')
st.write("""
         那么，每个区间的占比如何计算呢？
         \n\n用上面得到的价格区间的数量除以总的价格计数（count（价格）），
         就是对应区间的占比。还是以价格在0～50元区间为例，该区间占比如下：
         """)
st.image('sql_pic/13.png')
st.write("""
         为了让占比以百分比格式显示，可以对求出的占比×100，以百分比形式显示。
         例如(0，50)区间的占比是0.5077，那么百分比显示是0.5077×100=50.77%
         \n\n那么，在SQL中如何用百分比显示呢？
         \n\n可以用字符串连接函数concat()，例如50.77%表示为concat("0.5077"，%)。
         \n\n我们把区间(0，50)的占比修改成按百分比显示，SQL语句的书写方法如下：
         """)
st.image('sql_pic/14.png')
st.write("""
         知道了查询区间(0，50)的SQL语句，那么其他区间也是一样的写法，完整的SQL语句如下：
         """)
st.image('sql_pic/15.png')
st.image('sql_pic/16.png')
st.write('查询结果如下图所示')
st.image('sql_pic/17.png')
st.write("""
         分析结论：
         \n\n将价格分为4个区间，得出每个区间的商品种类数及占比。(0，50)价格区间的商品种类有2236个，
         占总商品种类数的50.77%；(51，100)价格区间的商品种类有1354个，占总商品种类数的30.74%。
         可以得出定价低于100元的商品种类数已经约占总商品种类数的81.5%。
         """)
st.write('##### 5. 找出螺蛳粉购买人数最多的前10个地域')
st.write("""
         (1)每个地域的总购买人数。
         \n\n按买家地址（地域）分组（group by买家地址），汇总得到每个地域的总购买人数（sum（购买人数））。
         \n\n(2)根据购买人数从高到低排序（order by sum（购买人数）desc），然后用limit 10得出购买人数最多的前10个地域。
         \n\nSQL语句的书写方法如下：
         """)
st.image('sql_pic/18.png')
st.write('查询结果如下图所示')
st.image('sql_pic/19.png')
st.write("""
         分析结论：
         \n\nTop 1的地域为广西柳州，总购买人数为4462324人；Top 2的地域为浙江嘉兴，总购买人数为664370人；
         Top 3的地域为上海，总购买人数为237323人。
         """)
st.write('#### 三、提出建议')
st.write("""
         通过以上分析结果，结合业务场景，可以给出以下几点建议，以便来年投放广告时参考。
         \n\n(1)对于螺蛳粉这一品类的商品，从店铺数和商品种类数量众多可以看出商家竞争激烈，但从销售额排名前10的店铺可以看出，
         头部店铺的销售额占比高达45%，销售额聚集在头部店铺。来年可在销售额排名前10的店铺加大广告投放，
         扩大头部店铺品牌的影响力，增加头部店铺销售额占比。
         \n\n(2)对于螺蛳粉这一品类，从商品价格区间和购买人数可以得出，定价在0～100元的商品种类数约占81.5%。
         平台商家在设置价格时可将商品价格设置在100元以内，以符合消费者购买倾向，避免因价格过高而降低消费者购买欲望。
         在广告投放中，可增加对100元以下的商品的宣传力度，将折扣力度更多放在这个价格区间内的商品。
         \n\n(3)通过分析购买螺蛳粉的买家地域偏好，得出买家集中在广西、浙江、上海，除了稳定这些地域的市场份额，
         来年在广告投放方面可以试着扩大受众面，对于广西、浙江、上海之外的市场，投入更多的商品价格优惠、
         商品宣传曝光增加买家的关注，扩大螺蛳粉这一品类的市场份额。
         """)
